------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Daniel Sanchez\OneDrive\Documentos\personal\docs\research\covid-vaccine\scvs_letter_stata\sc
> vs_log.log
  log type:  text
 opened on:  20 Apr 2022, 20:46:47

. 
. * For the two way clustering
. 
. egen double_cluster = group (province month)

. 
. * Encoding
. 
.  encode province, gen (prov)

.  
. * Run the regression:
. 
. reg lbuss did excessd_rate job_change v_deaths robbery transit_acc i.prov i.monthyear, vce (cluster double_clust
> er)

Linear regression                               Number of obs     =        576
                                                F(52, 287)        =     241.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9224
                                                Root MSE          =     .41358

                                          (Std. Err. adjusted for 288 clusters in double_cluster)
-------------------------------------------------------------------------------------------------
                                |               Robust
                          lbuss |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
                            did |  -.2152616    .074172    -2.90   0.004    -.3612517   -.0692715
                   excessd_rate |  -.1316244   .1346651    -0.98   0.329    -.3966809    .1334321
                     job_change |   -.000011   .0000186    -0.59   0.556    -.0000477    .0000257
                       v_deaths |   .0011473   .0015129     0.76   0.449    -.0018304    .0041251
                        robbery |   .0002576   .0003512     0.73   0.464    -.0004337    .0009489
                    transit_acc |   .0014335    .001114     1.29   0.199    -.0007592    .0036263
                                |
                           prov |
                       BOLIVAR  |  -2.752386   .1553375   -17.72   0.000    -3.058131   -2.446641
                        CARCHI  |  -2.680791   .1658944   -16.16   0.000    -3.007315   -2.354267
                         CAÑAR  |  -2.157967   .1451496   -14.87   0.000     -2.44366   -1.872275
                    CHIMBORAZO  |  -1.254961   .1121919   -11.19   0.000    -1.475784   -1.034137
                      COTOPAXI  |  -1.443176   .1452636    -9.93   0.000    -1.729093   -1.157259
                        EL ORO  |  -.4234954   .1018713    -4.16   0.000     -.624005   -.2229857
                    ESMERALDAS  |   -1.67897   .1251769   -13.41   0.000    -1.925351   -1.432589
                     GALAPAGOS  |  -2.007348   .1614011   -12.44   0.000    -2.325028   -1.689668
                        GUAYAS  |   .4059519   .6563518     0.62   0.537    -.8859218    1.697826
                      IMBABURA  |   -1.23641   .1176379   -10.51   0.000    -1.467952   -1.004867
                          LOJA  |  -1.162727   .1072862   -10.84   0.000    -1.373894   -.9515589
                      LOS RIOS  |  -1.159766   .1155871   -10.03   0.000    -1.387272   -.9322605
                        MANABI  |     -.4445   .1402218    -3.17   0.002    -.7204936   -.1685064
               MORONA SANTIAGO  |  -1.947008   .1453867   -13.39   0.000    -2.233167   -1.660848
                          NAPO  |  -2.639272   .1596251   -16.53   0.000    -2.953456   -2.325087
                      ORELLANA  |  -1.846039   .1427077   -12.94   0.000    -2.126925   -1.565152
                       PASTAZA  |   -2.64782   .1356122   -19.52   0.000     -2.91474   -2.380899
                     PICHINCHA  |   1.227185   .3259825     3.76   0.000     .5855655    1.868805
                   SANTA ELENA  |  -1.592288   .1408214   -11.31   0.000    -1.869461   -1.315114
SANTO DOMINGO DE LOS TSACHILAS  |  -1.149406   .1006993   -11.41   0.000    -1.347609   -.9512028
                     SUCUMBIOS  |  -1.957475   .1475588   -13.27   0.000    -2.247909    -1.66704
                    TUNGURAHUA  |  -1.000803   .1011658    -9.89   0.000    -1.199925   -.8016823
              ZAMORA CHINCHIPE  |  -1.514518    .137271   -11.03   0.000    -1.784703   -1.244332
                                |
                      monthyear |
                             2  |  -.0670735   .1463897    -0.46   0.647    -.3552071      .22106
                             3  |  -.5357843   .1190809    -4.50   0.000     -.770167   -.3014017
                             4  |  -2.197303    .195687   -11.23   0.000    -2.582467    -1.81214
                             5  |  -1.044346   .1447158    -7.22   0.000    -1.329185    -.759507
                             6  |   .0750308   .1335648     0.56   0.575    -.1878599    .3379215
                             7  |   .4065295   .1474712     2.76   0.006     .1162673    .6967917
                             8  |   .2820463   .1285144     2.19   0.029      .029096    .5349966
                             9  |   .4007111   .1040727     3.85   0.000     .1958685    .6055537
                            10  |   .3702334   .1040136     3.56   0.000     .1655071    .5749597
                            11  |   .1858857   .1020516     1.82   0.070    -.0149788    .3867502
                            12  |   .2053221    .106417     1.93   0.055    -.0041346    .4147788
                            13  |   .0907505   .1342414     0.68   0.500     -.173472    .3549729
                            14  |   .2030737   .1095484     1.85   0.065    -.0125464    .4186938
                            15  |   .5445072   .1408365     3.87   0.000     .2673037    .8217107
                            16  |   .4812024   .1567985     3.07   0.002     .1725816    .7898232
                            17  |   .6446424   .1355251     4.76   0.000     .3778933    .9113916
                            18  |   .5747442   .1129727     5.09   0.000     .3523841    .7971044
                            19  |   .5026019   .1092847     4.60   0.000     .2875007    .7177032
                            20  |   .5234605   .0994593     5.26   0.000     .3276982    .7192227
                            21  |   .5571789   .0940905     5.92   0.000     .3719839    .7423739
                            22  |   .5410134   .0966749     5.60   0.000     .3507317    .7312951
                            23  |   .5240321   .0918166     5.71   0.000     .3433128    .7047513
                            24  |   .4938929   .1171266     4.22   0.000     .2633568    .7244291
                                |
                          _cons |   3.744066   .1346132    27.81   0.000     3.479111     4.00902
-------------------------------------------------------------------------------------------------

. 
. * Run the wild bootstrap
. 
. boottest did, reps (9999) bootcluster(double_cluster) seed(1) nograph

Wild bootstrap-t, null imposed, 9999 replications, Wald test, bootstrap clustering by double_cluster, Rademacher w
> eights:
  did

                          t(287) =    -2.9022
                        Prob>|t| =     0.0035

95% confidence set for null hypothesis expression: [-.3645, -.07012]

. 
. * Run the other regression
. 
. reg lnsas did excessd_rate job_change v_deaths robbery transit_acc i.prov i.monthyear, vce (cluster double_clust
> er)

Linear regression                               Number of obs     =        576
                                                F(52, 287)        =     137.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8795
                                                Root MSE          =     .48122

                                          (Std. Err. adjusted for 288 clusters in double_cluster)
-------------------------------------------------------------------------------------------------
                                |               Robust
                          lnsas |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
                            did |   -.247031    .118846    -2.08   0.039    -.4809513   -.0131107
                   excessd_rate |   -.143435   .1319759    -1.09   0.278    -.4031984    .1163284
                     job_change |   -.000013   .0000252    -0.51   0.607    -.0000625    .0000366
                       v_deaths |   .0023357   .0019205     1.22   0.225    -.0014444    .0061158
                        robbery |   .0001883   .0003674     0.51   0.609    -.0005348    .0009114
                    transit_acc |   .0016689   .0012335     1.35   0.177     -.000759    .0040969
                                |
                           prov |
                       BOLIVAR  |  -2.336239   .1772826   -13.18   0.000    -2.685178     -1.9873
                        CARCHI  |  -2.286789   .1695133   -13.49   0.000    -2.620436   -1.953142
                         CAÑAR  |  -2.049464   .1377127   -14.88   0.000    -2.320519   -1.778409
                    CHIMBORAZO  |  -.9151928   .1306303    -7.01   0.000    -1.172308    -.658078
                      COTOPAXI  |  -1.211636   .1647014    -7.36   0.000    -1.535811   -.8874597
                        EL ORO  |   .1041056    .119664     0.87   0.385    -.1314249     .339636
                    ESMERALDAS  |  -1.132666   .1447023    -7.83   0.000    -1.417479   -.8478542
                     GALAPAGOS  |     -1.627   .1766052    -9.21   0.000    -1.974605   -1.279394
                        GUAYAS  |   .5478253   .6786125     0.81   0.420    -.7878633    1.883514
                      IMBABURA  |  -1.006724   .1221615    -8.24   0.000    -1.247171   -.7662782
                          LOJA  |  -.9254679   .1312565    -7.05   0.000    -1.183815   -.6671205
                      LOS RIOS  |  -.8015605   .1252088    -6.40   0.000    -1.048005   -.5551165
                        MANABI  |  -.1003968   .1607491    -0.62   0.533    -.4167935    .2159999
               MORONA SANTIAGO  |   -1.53151   .1664818    -9.20   0.000     -1.85919    -1.20383
                          NAPO  |  -2.395476   .1756673   -13.64   0.000    -2.741235   -2.049716
                      ORELLANA  |  -1.496833   .1597385    -9.37   0.000     -1.81124   -1.182425
                       PASTAZA  |  -2.220253   .1620802   -13.70   0.000     -2.53927   -1.901237
                     PICHINCHA  |   1.232902    .332461     3.71   0.000     .5785309    1.887273
                   SANTA ELENA  |  -1.251024   .1631646    -7.67   0.000    -1.572175   -.9298726
SANTO DOMINGO DE LOS TSACHILAS  |  -.7537329   .1314842    -5.73   0.000    -1.012529   -.4949373
                     SUCUMBIOS  |   -1.52092   .1535897    -9.90   0.000    -1.823225   -1.218615
                    TUNGURAHUA  |   -.838253   .1203281    -6.97   0.000     -1.07509   -.6014156
              ZAMORA CHINCHIPE  |   -.823627   .1531845    -5.38   0.000    -1.125134   -.5221195
                                |
                      monthyear |
                             2  |  -.0725613   .1398981    -0.52   0.604    -.3479176     .202795
                             3  |  -.5375651   .1191973    -4.51   0.000     -.772177   -.3029533
                             4  |  -2.187026     .18716   -11.69   0.000    -2.555407   -1.818646
                             5  |  -1.077346   .1468641    -7.34   0.000    -1.366413    -.788279
                             6  |  -.1021104   .1270211    -0.80   0.422    -.3521215    .1479006
                             7  |   .0370333   .1512854     0.24   0.807    -.2607363    .3348029
                             8  |  -.1783332   .1290625    -1.38   0.168    -.4323623    .0756959
                             9  |  -.1215939   .1176579    -1.03   0.302    -.3531758     .109988
                            10  |  -.2893209   .1309212    -2.21   0.028    -.5470083   -.0316334
                            11  |  -.5074632   .1220575    -4.16   0.000    -.7477045   -.2672218
                            12  |   -.391277   .1279512    -3.06   0.002    -.6431187   -.1394353
                            13  |  -.5307198   .1569803    -3.38   0.001    -.8396984   -.2217412
                            14  |  -.5825137   .1217907    -4.78   0.000      -.82223   -.3427975
                            15  |  -.3035525    .146918    -2.07   0.040     -.592726    -.014379
                            16  |  -.3080743   .1684919    -1.83   0.069    -.6397109    .0235623
                            17  |  -.2867983   .1444899    -1.98   0.048    -.5711925    -.002404
                            18  |   -.410864   .1371872    -2.99   0.003    -.6808846   -.1408434
                            19  |  -.4913307   .1031178    -4.76   0.000    -.6942938   -.2883675
                            20  |  -.5948022   .1135942    -5.24   0.000    -.8183857   -.3712188
                            21  |  -.5771031   .1314607    -4.39   0.000    -.8358525   -.3183537
                            22  |  -.6224426   .1268162    -4.91   0.000    -.8720504   -.3728347
                            23  |  -.6516679   .1229668    -5.30   0.000     -.893699   -.4096367
                            24  |  -.7676427   .1401464    -5.48   0.000    -1.043488   -.4917977
                                |
                          _cons |   3.412184   .1435916    23.76   0.000     3.129558     3.69481
-------------------------------------------------------------------------------------------------

. 
. * Run the wild bootstrap
. 
. boottest did, reps (9999) bootcluster(double_cluster) seed(1) nograph

Wild bootstrap-t, null imposed, 9999 replications, Wald test, bootstrap clustering by double_cluster, Rademacher w
> eights:
  did

                          t(287) =    -2.0786
                        Prob>|t| =     0.0409

95% confidence set for null hypothesis expression: [-.4822, -.01057]

. 
.  * Turn off the log
. log close 
      name:  <unnamed>
       log:  C:\Users\Daniel Sanchez\OneDrive\Documentos\personal\docs\research\covid-vaccine\scvs_letter_stata\sc
> vs_log.log
  log type:  text
 closed on:  20 Apr 2022, 20:46:49
------------------------------------------------------------------------------------------------------------------
